report/stage_3/profiling/blocking_queue/sync/wrk2_sync2_put.txt
$ wrk2 -c 128 -t 8 -d 125s -R 50000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_sync2_put.txt


Running 2m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.124ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.121ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.138ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.143ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.065ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.123ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.122ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.142ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  718.26us  48.29ms   85.42%
    Req/Sec     6.58k   499.47    14.33k    75.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.39ms
 90.000%    1.72ms
 99.000%    2.96ms
 99.900%    7.01ms
 99.990%   23.18ms
 99.999%   41.89ms
100.000%   48.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.019     0.000000            1         1.00
       0.437     0.100000       576640         1.11
       0.609     0.200000      1150602         1.25
       0.751     0.300000      1725394         1.43
       0.885     0.400000      2300327         1.67
       1.019     0.500000      2876128         2.00
       1.087     0.550000      3160411         2.22
       1.158     0.600000      3448478         2.50
       1.231     0.650000      3735115         2.86
       1.307     0.700000      4023947         3.33
       1.387     0.750000      4310462         4.00
       1.430     0.775000      4454020         4.44
       1.476     0.800000      4596988         5.00
       1.527     0.825000      4742880         5.71
       1.583     0.850000      4885932         6.67
       1.646     0.875000      5027759         8.00
       1.682     0.887500      5099930         8.89
       1.722     0.900000      5172782        10.00
       1.766     0.912500      5244148        11.43
       1.817     0.925000      5316220        13.33
       1.877     0.937500      5386980        16.00
       1.913     0.943750      5423527        17.78
       1.953     0.950000      5459052        20.00
       2.001     0.956250      5494956        22.86
       2.059     0.962500      5531252        26.67
       2.131     0.968750      5567073        32.00
       2.175     0.971875      5584584        35.56
       2.229     0.975000      5602544        40.00
       2.297     0.978125      5620650        45.71
       2.385     0.981250      5638244        53.33
       2.513     0.984375      5656241        64.00
       2.603     0.985938      5665301        71.11
       2.713     0.987500      5674157        80.00
       2.857     0.989062      5683158        91.43
       3.039     0.990625      5692139       106.67
       3.261     0.992188      5701126       128.00
       3.395     0.992969      5705613       142.22
       3.547     0.993750      5710063       160.00
       3.727     0.994531      5714538       182.86
       3.943     0.995313      5719042       213.33
       4.203     0.996094      5723555       256.00
       4.351     0.996484      5725765       284.44
       4.531     0.996875      5728023       320.00
       4.747     0.997266      5730259       365.71
       5.011     0.997656      5732503       426.67
       5.339     0.998047      5734752       512.00
       5.563     0.998242      5735872       568.89
       5.823     0.998437      5736988       640.00
       6.143     0.998633      5738111       731.43
       6.539     0.998828      5739231       853.33
       7.095     0.999023      5740352      1024.00
       7.459     0.999121      5740911      1137.78
       7.911     0.999219      5741469      1280.00
       8.431     0.999316      5742032      1462.86
       9.087     0.999414      5742596      1706.67
       9.999     0.999512      5743153      2048.00
      10.575     0.999561      5743437      2275.56
      11.127     0.999609      5743712      2560.00
      11.887     0.999658      5743995      2925.71
      12.863     0.999707      5744274      3413.33
      14.135     0.999756      5744556      4096.00
      15.215     0.999780      5744694      4551.11
      16.271     0.999805      5744835      5120.00
      17.695     0.999829      5744976      5851.43
      19.583     0.999854      5745117      6826.67
      21.375     0.999878      5745255      8192.00
      22.303     0.999890      5745326      9102.22
      23.407     0.999902      5745395     10240.00
      24.719     0.999915      5745466     11702.86
      26.303     0.999927      5745537     13653.33
      28.127     0.999939      5745607     16384.00
      29.087     0.999945      5745641     18204.44
      30.575     0.999951      5745676     20480.00
      31.695     0.999957      5745711     23405.71
      33.119     0.999963      5745746     27306.67
      34.655     0.999969      5745781     32768.00
      35.615     0.999973      5745799     36408.89
      36.351     0.999976      5745816     40960.00
      37.343     0.999979      5745834     46811.43
      38.687     0.999982      5745852     54613.33
      39.775     0.999985      5745869     65536.00
      40.639     0.999986      5745879     72817.78
      40.927     0.999988      5745887     81920.00
      41.503     0.999989      5745895     93622.86
      42.175     0.999991      5745904    109226.67
      42.879     0.999992      5745915    131072.00
      42.943     0.999993      5745917    145635.56
      43.263     0.999994      5745921    163840.00
      43.807     0.999995      5745926    187245.71
      44.127     0.999995      5745930    218453.33
      45.375     0.999996      5745935    262144.00
      45.439     0.999997      5745937    291271.11
      45.567     0.999997      5745939    327680.00
      46.463     0.999997      5745941    374491.43
      46.687     0.999998      5745943    436906.67
      46.975     0.999998      5745946    524288.00
      47.071     0.999998      5745947    582542.22
      47.359     0.999998      5745948    655360.00
      47.455     0.999999      5745950    748982.86
      47.455     0.999999      5745950    873813.33
      47.935     0.999999      5745951   1048576.00
      47.967     0.999999      5745952   1165084.44
      47.967     0.999999      5745952   1310720.00
      47.999     0.999999      5745953   1497965.71
      47.999     0.999999      5745953   1747626.67
      48.159     1.000000      5745954   2097152.00
      48.159     1.000000      5745954   2330168.89
      48.159     1.000000      5745954   2621440.00
      48.287     1.000000      5745955   2995931.43
      48.287     1.000000      5745955   3495253.33
      48.287     1.000000      5745955   4194304.00
      48.287     1.000000      5745955   4660337.78
      48.287     1.000000      5745955   5242880.00
      48.319     1.000000      5745956   5991862.86
      48.319     1.000000      5745956          inf
#[Mean    =        1.087, StdDeviation   =        0.718]
#[Max     =       48.288, Total count    =      5745956]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6241976 requests in 2.08m, 398.84MB read
Requests/sec:  49937.48
Transfer/sec:      3.19MB